Repository: runceel/wsl-containers-desktop
Catalog: src/WslContainersDesktop.App/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# MainWindow.Title
source: Hakonexa - WSL Containers Manager
ja_jp: Hakonexa - WSL コンテナーマネージャー

# AppTitleBar.Title
source: Hakonexa - WSL Containers Manager
ja_jp: Hakonexa - WSL コンテナーマネージャー

# NavItemDashboard.Content
source: Dashboard
ja_jp: ダッシュボード

# NavItemContainers.Content
source: Containers
ja_jp: コンテナー

# NavItemImages.Content
source: Images
ja_jp: イメージ

# NavItemVolumes.Content
source: Volumes
ja_jp: ボリューム

# NavItemNetworks.Content
source: Networks
ja_jp: ネットワーク

# NavItemSettings.Content
source: Settings
ja_jp: 設定

# DashboardPageTitle.Text
source: Dashboard
ja_jp: ダッシュボード

# DashboardPageDescription.Text
source: An overview of the WSL Containers resources on this machine.
ja_jp: このコンピューター上の WSL コンテナーリソースの概要です。

# BtnRefreshDashboard.Content
source: Refresh
ja_jp: 更新

# LblDashboardRunningContainers.Text
source: Running containers
ja_jp: 実行中のコンテナー

# LblDashboardStoppedContainers.Text
source: Stopped containers
ja_jp: 停止中のコンテナー

# LblDashboardImages.Text
source: Images
ja_jp: イメージ

# LblDashboardVolumes.Text
source: Volumes
ja_jp: ボリューム

# LblDashboardNetworks.Text
source: Networks
ja_jp: ネットワーク

# DashboardStatsTitle.Text
source: Running container resource usage
ja_jp: 実行中のコンテナーのリソース使用量

# TxtDashboardStatsColumnName.Text
source: Name
ja_jp: 名前

# TxtDashboardStatsColumnMemory.Text
source: Memory
ja_jp: メモリ

# BtnDashboardStatsDetails.Content
source: Details
ja_jp: 詳細

# BtnDashboardStatsLogs.Content
source: Logs
ja_jp: ログ

# TxtDashboardStatsEmptyState.Text
source: No running containers.
ja_jp: 実行中のコンテナーはありません。

# TxtDashboardStatsLoading.Text
source: Loading…
ja_jp: 読み込み中…

# ContainersPageTitle.Text
source: Containers
ja_jp: コンテナー

# ContainersPageDescription.Text
source: View and manage the WSL Containers currently on this machine.
ja_jp: このコンピューター上の WSL コンテナーを表示・管理します。

# BtnRefresh.Content
source: Refresh
ja_jp: 更新

# TxtEmptyStateTitle.Text
source: No containers found
ja_jp: コンテナーが見つかりません

# TxtEmptyStateDescription.Text
source: Containers you create will appear here.
ja_jp: 作成したコンテナーがここに表示されます。

# TxtColumnHeaderName.Text
source: Name
ja_jp: 名前

# TxtColumnHeaderImage.Text
source: Image
ja_jp: イメージ

# TxtColumnHeaderState.Text
source: State
ja_jp: 状態

# TxtColumnHeaderCreatedAt.Text
source: Created
ja_jp: 作成日時

# BtnRestart.Content
source: Restart
ja_jp: 再起動

# BtnDelete.Content
source: Delete
ja_jp: 削除

# BtnLogs.Content
source: Logs
ja_jp: ログ

# BtnDetails.Content
source: Details
ja_jp: 詳細

# BtnShell.Content
source: Shell
ja_jp: シェル

# MenuDetails.Text
source: Details
ja_jp: 詳細

# MenuShell.Text
source: Shell
ja_jp: シェル

# MenuLogs.Text
source: Logs
ja_jp: ログ

# MenuRestart.Text
source: Restart
ja_jp: 再起動

# MenuDelete.Text
source: Delete
ja_jp: 削除

# TxtLogPanelTitle.Text
source: Container logs
ja_jp: コンテナーのログ

# BtnPauseLogs.Content
source: Pause
ja_jp: 一時停止

# BtnResumeLogs.Content
source: Resume
ja_jp: 再開

# BtnClearLogs.Content
source: Clear
ja_jp: クリア

# BtnCloseLogs.Content
source: Close
ja_jp: 閉じる

# BtnOpenLogsWindow.Content
source: Open in window
ja_jp: ウィンドウで開く

# TxtLogEmptyState.Text
source: No logs to display.
ja_jp: 表示するログはありません。

# TxtDetailPanelTitle.Text
source: Container details
ja_jp: コンテナーの詳細

# BtnCloseDetails.Content
source: Close
ja_jp: 閉じる

# TxtShellPanelTitle.Text
source: Container shell
ja_jp: コンテナーシェル

# BtnOpenShellWindow.Content
source: Open in window
ja_jp: ウィンドウで開く

# BtnCloseShell.Content
source: Close shell
ja_jp: シェルを閉じる

# TxtShellCommand.Header
source: Command
ja_jp: コマンド

# BtnSendShellCommand.Content
source: Send
ja_jp: 送信

# LogsWindow.Title
source: Container logs
ja_jp: コンテナーのログ

# ShellWindow.Title
source: Container shell
ja_jp: コンテナーシェル

# ImagesPageTitle.Text
source: Images
ja_jp: イメージ

# ImagesPageDescription.Text
source: Pull, run, and remove container images.
ja_jp: コンテナーイメージの取得、実行、削除を行います。

# BtnRefreshImages.Content
source: Refresh
ja_jp: 更新

# TxtPullReference.Header
source: Image reference
ja_jp: イメージ参照

# BtnPullImage.Content
source: Pull
ja_jp: 取得

# BtnRunImage.Content
source: Run
ja_jp: 実行

# BtnDeleteImage.Content
source: Delete
ja_jp: 削除

# RunImageDialog.Title
source: Run image
ja_jp: イメージを実行

# RunImageDialog.PrimaryButtonText
source: Run
ja_jp: 実行

# RunImageDialog.CloseButtonText
source: Cancel
ja_jp: キャンセル

# TxtRunContainerName.Header
source: Container name
ja_jp: コンテナー名

# TxtRunContainerName.PlaceholderText
source: Optional
ja_jp: 任意

# TglRunRemoveWhenStopped.Header
source: Remove when stopped
ja_jp: 停止時に削除

# TxtRunPortMappings.Header
source: Port mappings
ja_jp: ポートマッピング

# TxtRunEnvironmentVariables.Header
source: Environment variables
ja_jp: 環境変数

# TxtRunCommand.Header
source: Command
ja_jp: コマンド

# TxtImagesEmptyState.Text
source: No images.
ja_jp: イメージはありません。

# TxtImageColumnName.Text
source: Name
ja_jp: 名前

# TxtImageColumnSize.Text
source: Size
ja_jp: サイズ

# TxtImageColumnCreatedAt.Text
source: Created
ja_jp: 作成日時

# VolumesPageTitle.Text
source: Volumes
ja_jp: ボリューム

# VolumesPageDescription.Text
source: Create and remove container volumes.
ja_jp: コンテナーボリュームの作成・削除を行います。

# BtnRefreshVolumes.Content
source: Refresh
ja_jp: 更新

# TxtNewVolumeName.Header
source: Volume name
ja_jp: ボリューム名

# BtnCreateVolume.Content
source: Create
ja_jp: 作成

# TxtVolumeColumnName.Text
source: Name
ja_jp: 名前

# TxtVolumeColumnDriver.Text
source: Driver
ja_jp: ドライバー

# TxtVolumeColumnCreatedAt.Text
source: Created
ja_jp: 作成日時

# TxtVolumeColumnUsage.Text
source: Usage
ja_jp: 使用状況

# BtnDeleteVolume.Content
source: Delete
ja_jp: 削除

# TxtVolumesEmptyState.Text
source: No volumes.
ja_jp: ボリュームはありません。

# NetworksPageTitle.Text
source: Networks
ja_jp: ネットワーク

# NetworksPageDescription.Text
source: Create and remove container networks.
ja_jp: コンテナーネットワークの作成・削除を行います。

# BtnRefreshNetworks.Content
source: Refresh
ja_jp: 更新

# TxtNewNetworkName.Header
source: Network name
ja_jp: ネットワーク名

# BtnCreateNetwork.Content
source: Create
ja_jp: 作成

# InfoBarNoUserNetworks.Title
source: No user-created networks
ja_jp: ユーザー作成のネットワークはありません

# InfoBarNoUserNetworks.Message
source: System networks are shown and cannot be deleted.
ja_jp: システムネットワークは表示されますが、削除できません。

# TxtNetworkColumnName.Text
source: Name
ja_jp: 名前

# TxtNetworkColumnDriver.Text
source: Driver
ja_jp: ドライバー

# TxtNetworkColumnCreatedAt.Text
source: Created
ja_jp: 作成日時

# TxtNetworkColumnContainers.Text
source: Containers
ja_jp: コンテナー

# TxtNetworkColumnType.Text
source: Type
ja_jp: 種類

# TxtNetworkColumnUsage.Text
source: Usage
ja_jp: 使用状況

# BtnDeleteNetwork.Content
source: Delete
ja_jp: 削除

# TxtNetworksEmptyState.Text
source: No networks.
ja_jp: ネットワークはありません。

# ContainerState_Running
source: Running
ja_jp: 実行中

# ContainerState_Stopped
source: Stopped
ja_jp: 停止中

# ContainerState_Starting
source: Starting…
ja_jp: 開始中…

# ContainerState_Stopping
source: Stopping…
ja_jp: 停止中…

# ContainerState_Restarting
source: Restarting…
ja_jp: 再起動中…

# ContainerState_Deleting
source: Deleting…
ja_jp: 削除中…

# DeleteConfirmationDialog_Title
source: Delete container
ja_jp: コンテナーを削除

# DeleteConfirmationDialog_Message
source: Are you sure you want to delete '{0}'? This action cannot be undone.
ja_jp: '{0}' を削除してもよろしいですか？この操作は元に戻せません。

# DeleteConfirmationDialog_PrimaryButtonText
source: Delete
ja_jp: 削除

# DeleteConfirmationDialog_CloseButtonText
source: Cancel
ja_jp: キャンセル

# DeleteImageConfirmationDialog_Title
source: Delete image
ja_jp: イメージを削除

# DeleteImageConfirmationDialog_Message
source: Are you sure you want to delete '{0}'? This action cannot be undone.
ja_jp: '{0}' を削除してもよろしいですか？この操作は元に戻せません。

# DeleteImageConfirmationDialog_PrimaryButtonText
source: Delete
ja_jp: 削除

# DeleteImageConfirmationDialog_CloseButtonText
source: Cancel
ja_jp: キャンセル

# DeleteVolumeConfirmationDialog_Title
source: Delete volume
ja_jp: ボリュームを削除

# DeleteVolumeConfirmationDialog_Message
source: Are you sure you want to delete volume '{0}'? This action cannot be undone.
ja_jp: ボリューム '{0}' を削除してもよろしいですか？この操作は元に戻せません。

# DeleteVolumeConfirmationDialog_PrimaryButtonText
source: Delete
ja_jp: 削除

# DeleteVolumeConfirmationDialog_CloseButtonText
source: Cancel
ja_jp: キャンセル

# DeleteNetworkConfirmationDialog_Title
source: Delete network
ja_jp: ネットワークを削除

# DeleteNetworkConfirmationDialog_Message
source: Are you sure you want to delete network '{0}'? This action cannot be undone.
ja_jp: ネットワーク '{0}' を削除してもよろしいですか？この操作は元に戻せません。

# DeleteNetworkConfirmationDialog_PrimaryButtonText
source: Delete
ja_jp: 削除

# DeleteNetworkConfirmationDialog_CloseButtonText
source: Cancel
ja_jp: キャンセル

# SettingsPageTitle.Text
source: Settings
ja_jp: 設定

# SettingsPageDescription.Text
source: Review WSL integration status and configure WSL resource limits.
ja_jp: WSL 統合の状態を確認し、WSL リソース制限を設定します。

# SettingsAppName.Text
source: Hakonexa - WSL Containers Manager
ja_jp: Hakonexa - WSL コンテナーマネージャー

# SettingsAppPurpose.Text
source: Manage WSL Containers from a native Windows desktop app.
ja_jp: ネイティブ Windows デスクトップアプリから WSL コンテナーを管理します。

# TxtAppVersionLabel.Text
source: App version:
ja_jp: アプリのバージョン:

# TxtWslIntegrationHeader.Text
source: WSL integration status
ja_jp: WSL 統合の状態

# TxtWslVersionLabel.Text
source: WSL version:
ja_jp: WSL のバージョン:

# ChkWslContainersAvailable.Content
source: WSL Containers CLI (wslc) detected
ja_jp: WSL Containers CLI (wslc) を検出しました

# InfoBarRequirementsWarning.Title
source: Requirements not met
ja_jp: 要件を満たしていません

# InfoBarRequirementsWarning.Message
source: WSL 2.9.3 or later with the WSL Containers CLI (wslc) is required to change resource limits.
ja_jp: リソース制限を変更するには、WSL Containers CLI (wslc) を含む WSL 2.9.3 以降が必要です。

# TxtResourceLimitsHeader.Text
source: Resource limits
ja_jp: リソース制限

# TxtResourceLimitsHint.Text
source: Leave a field blank to use the WSL default. Changes take effect after you restart WSL by running 'wsl --shutdown'.
ja_jp: 空欄にすると WSL の既定値を使用します。'wsl --shutdown' を実行して WSL を再起動すると変更が反映されます。

# TxtMemoryMegabytes.Header
source: Memory (MB)
ja_jp: メモリ (MB)

# TxtMemoryMegabytes.PlaceholderText
source: WSL default
ja_jp: WSL の既定値

# TxtProcessorCount.Header
source: Processors
ja_jp: プロセッサ数

# TxtProcessorCount.PlaceholderText
source: WSL default
ja_jp: WSL の既定値

# BtnSaveResourceLimits.Content
source: Save
ja_jp: 保存

# BtnResetResourceLimits.Content
source: Reset to default
ja_jp: 既定値に戻す

# ResetResourceLimitsConfirmationDialog_Title
source: Reset resource limits
ja_jp: リソース制限をリセット

# ResetResourceLimitsConfirmationDialog_Message
source: Reset the memory and processor limits to the WSL defaults? Restart WSL (run 'wsl --shutdown') to apply the change.
ja_jp: メモリとプロセッサの制限を WSL の既定値に戻しますか？変更を適用するには WSL を再起動（'wsl --shutdown' を実行）してください。

# ResetResourceLimitsConfirmationDialog_PrimaryButtonText
source: Reset
ja_jp: リセット

# ResetResourceLimitsConfirmationDialog_CloseButtonText
source: Cancel
ja_jp: キャンセル

# AppDisplayName
source: Hakonexa - WSL Containers Manager
ja_jp: Hakonexa - WSL コンテナーマネージャー

# AppDescription
source: Hakonexa - WSL Containers Manager
ja_jp: Hakonexa - WSL コンテナーマネージャー
